Revit 2024 API
Railing.HasHost Property
 Indicates if the railing has a host.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasHost { get; }
Visual Basic
Public ReadOnly Property HasHost As Boolean
	Get
Visual C++
public:
property bool HasHost {
	bool get ();
}
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace